In [26]:
import numpy as np
import pandas as pd
from pandas import Series
da1={"anuj":26,"priya":27,"hitesh":41}
da1

{'anuj': 26, 'priya': 27, 'hitesh': 41}

In [23]:
da1

{'anuj': 26, 'priya': 27, 'hitesh': 41}

In [11]:
from pandas import Series
data1=Series(["anil","Usha","Ankur","Reean"],index=[1,2,3,4])

In [12]:
data1

1     anil
2     Usha
3    Ankur
4    Reean
dtype: object

In [25]:
a1={"aq":1,"ad":2}
a1.keys()

dict_keys(['aq', 'ad'])

In [3]:
import pandas as pd
from pandas import DataFrame

In [5]:
dict={"Name":["max","mini","tania"],"age":[25,26,26],"percentage":[68,78,89]}
df=DataFrame(dict)
df

    Name  age  percentage
0    max   25          68
1   mini   26          78
2  tania   26          89

In [6]:
df["age"]

0    25
1    26
2    26
Name: age, dtype: int64

In [12]:
df.iloc[1]

Name          mini
age             26
percentage      78
Name: 1, dtype: object

In [7]:
df

    Name  age  percentage
0    max   25          68
1   mini   26          78
2  tania   26          89

In [8]:
df.T

              0     1      2
Name        max  mini  tania
age          25    26     26
percentage   68    78     89

In [9]:
df

    Name  age  percentage
0    max   25          68
1   mini   26          78
2  tania   26          89

In [11]:
df=DataFrame(dict,columns=["Name","percentage","age"])

In [12]:
df

    Name  percentage  age
0    max          68   25
1   mini          78   26
2  tania          89   26

In [13]:
df.sort_values("percentage")

    Name  percentage  age
0    max          68   25
1   mini          78   26
2  tania          89   26

In [14]:
df.sort_values("age")

    Name  percentage  age
0    max          68   25
1   mini          78   26
2  tania          89   26

In [16]:
df1=df.sort_index()
df1

    Name  percentage  age
0    max          68   25
1   mini          78   26
2  tania          89   26

In [17]:
from pandas import Series
s1=Series([7,4,1],index=["japan","S.Korea","India"])
s1

japan      7
S.Korea    4
India      1
dtype: int64

In [18]:
s1.sort_values()

India      1
S.Korea    4
japan      7
dtype: int64

In [1]:
from pandas import DataFrame
dict1={"cse":[15,11,13],"maths":[5,7,6],"english":[15,17,18]}
dict1

{'cse': [15, 11, 13], 'maths': [5, 7, 6], 'english': [15, 17, 18]}

In [3]:
df01=DataFrame(dict1)
df01

   cse  maths  english
0   15      5       15
1   11      7       17
2   13      6       18

In [4]:
df01.sum()

cse        39
maths      18
english    50
dtype: int64

In [5]:
df01.sum(axis=1)

0    35
1    35
2    37
dtype: int64

In [6]:
df01.idxmax()

cse        0
maths      1
english    2
dtype: int64

In [7]:
df01.idxmin()

cse        1
maths      0
english    0
dtype: int64

In [9]:
from pandas import Series
s1=Series([10,11,12],index=["cs","maths","hindi"])
s1

cs       10
maths    11
hindi    12
dtype: int64

In [10]:
s2=Series([16,17,18],index=["cs","maths","hindi"])
s2

cs       16
maths    17
hindi    18
dtype: int64

In [11]:
s1+s2

cs       26
maths    28
hindi    30
dtype: int64

In [10]:
from pandas import DataFrame
from pandas import Series
dic1={"GQ":[11,17,15],"GW":[4,1,3]}
df1=DataFrame(dic1)
df1

   GQ  GW
0  11   4
1  17   1
2  15   3

In [4]:
dic2={"GQ":[1,3,7],"GW":[3,3,1]}
df2=DataFrame(dic2)
df2

   GQ  GW
0   1   3
1   3   3
2   7   1

In [5]:
df1+df2

   GQ  GW
0  12   7
1  20   4
2  22   4

In [6]:
df1*df2

    GQ  GW
0   11  12
1   51   3
2  105   3

In [7]:
dic3={"cs":[15,11,13],"maths":[5,7,6]}
df3=DataFrame(dic3)
df3

   cs  maths
0  15      5
1  11      7
2  13      6

In [11]:
s1=Series([10,11,12],index=["cs","english","maths"])
s1

cs         10
english    11
maths      12
dtype: int64

In [12]:
df3+s1

   cs  english  maths
0  25      NaN     17
1  21      NaN     19
2  23      NaN     18